GC-SEARCH1-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: GC-SEARCH1-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: GC-SEARCH1-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  GC-SEARCH1-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://gcmarketplaceplaygroud.azurewebsites.net/)
      - clickByID(humburger_icon)
      - clickByCSS(span.icon.glyphicon.glyphicon-search)

  GC-SEARCH1-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      Referer: 'http://gcmarketplaceplaygroud.azurewebsites.net/'
      Accept-Encoding: 'gzip, deflate'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://gcmarketplaceplaygroud.azurewebsites.net/search'
            method: GET
            label: 'http://gcmarketplaceplaygroud.azurewebsites.net/search'
            think-time: 0ms
            headers: {}
            body:
              search_api_fulltext: ''